app/controllers/mpesas_controller.rb

DELETE FROM "access_tokens" WHERE "access_tokens"."id" = $1  [["id", 134]]
INSERT INTO "access_tokens" ("token", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["token", "[FILTERED]"], ["created_at", "2023-01-22 17:42:38.322624"], ["updated_at", "2023-01-22 17:42:38.322624"]]
---
    def get_access_token

        res = generate_access_token_request()
        if res.code != 200
            r = generate_access_token_request()
            if res.code != 200
                raise MpesaError('Unable to generate access token')
            end
        end

        body = JSON.parse(res, { symbolize_names: true })
        token = body[:access_token]
        AccessToken.destroy_all()
        AccessToken.create!(token: token)